levizh/hc32m423/ddl/hc32m423_ddl/driver/inc/hc32m423_timerb.h
/**
 *******************************************************************************
 * @file  hc32m423_timerb.h
 * @brief This file contains all the functions prototypes of the TimerB driver
 *        library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2019-07-03       Hongjh          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */
#ifndef __HC32M423_TIMERB_H__
#define __HC32M423_TIMERB_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @addtogroup DDL_TIMERB
 * @{
 */

#if (DDL_TIMERB_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup TIMERB_Global_Types TimerB Global Types
 * @{
 */

/**
 * @brief TimerB initialization structure definition
 */
typedef struct
{
    uint16_t u16CntMode;                /*!< TimerB count mode.
                                             This parameter can be a value of @ref TIMERB_Count_Mode */

    uint16_t u16CntDir;                 /*!< TimerB count direction.
                                             This parameter can be a value of @ref TIMERB_Count_Direction */

    uint16_t u16SynStartState;          /*!< Enable/disable synchronization start function and only unit n(2, 4, 6, 8) is valid.
                                             This parameter can be a value of @ref TIMERB_Synchronization_Start_State */

    uint16_t u16ClkDiv;                 /*!< TimerB Count clock division select.
                                             This parameter can be a value of @ref TIMERB_ClockDivision */

    uint16_t u16PeriodVal;              /*!< TimerB period value.
                                             This parameter can be a value of half-word */

    uint16_t u16OverflowAction;         /*!< Stop/continue count when TimerB count overflow.
                                             This parameter can be a value of @ref TIMERB_Overflow_Control */

    uint16_t u16HwStartCondition;       /*!< TIMERB hardware trigger start count condition.
                                             This parameter can be a value of @ref TIMERB_Hardware_Start_Count_Condition */

    uint16_t u16HwStopCondition;        /*!< TIMERB hardware trigger stop count condition.
                                             This parameter can be a value of @ref TIMERB_Hardware_Stop_Count_Condition */

    uint16_t u16HwClearCondition;       /*!< TIMERB hardware trigger clear count condition.
                                             This parameter can be a value of @ref TIMERB_Hardware_Clear_Count_Condition */

    uint16_t u16HwUpCondition;          /*!< TIMERB hardware trigger count up condition.
                                             This parameter can be a value of @ref TIMERB_Hardware_Count_Up_Condition */

    uint16_t u16HwDownCondition;        /*!< TIMERB hardware trigger count down condition.
                                             This parameter can be a value of @ref TIMERB_Hardware_Count_Down_Condition */
} stc_timerb_init_t;

/**
 * @brief TimerB output compare initialization structure definition
 */
typedef struct
{
    uint16_t u16CompareVal;             /*!< TimerB compare value.
                                             This parameter can be a value of half-word */

    uint16_t u16PortOutputState;        /*!< TIMB_<t>_PWM1 port output state
                                             This parameter can be a value of @ref TIMERB_OC_Port_Output_State */

    uint16_t u16StartCntOutput;         /*!< TIMB_<t>_PWM1 output polarity when start count.
                                             This parameter can be a value of @ref TIMERB_OC_Start_Count_Output_Polarity */

