levizh/hc32m423/ddl/hc32m423_ddl/driver/inc/hc32m423_timerb.h
    uint16_t u16StopCntOutput;          /*!< TIMB_<t>_PWM1 output polarity when stop count
                                             This parameter can be a value of @ref TIMERB_OC_Stop_Count_Output_Polarity */

    uint16_t u16CompareMatchOutput;     /*!< TIMB_<t>_PWM1 output polarity when compare value match
                                             This parameter can be a value of @ref TIMERB_OC_Compare_Match_Output_Polarity */

    uint16_t u16PeriodMatchOutput;      /*!< TIMB_<t>_PWM1 output polarity when period value match
                                             This parameter can be a value of @ref TIMERB_OC_Period_Match_Output_Polarity */
} stc_timerb_oc_init_t;

/**
 * @brief TimerB input capture initialization structure definition
 */
typedef struct
{
    uint16_t u16NoiseFilterClkDiv;      /*!< TimerB Noise filter clock division.
                                             This parameter can be a value of @ref TIMERB_Input_Capture_Noise_Filter_Clock_Division */

    uint16_t u16CaptureCondition;       /*!< TimerB input capture  condition.
                                             This parameter can be a value of @ref TIMERB_Input_Capture_Condition */
} stc_timerb_ic_init_t;

/**
 * @}
 */

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TIMERB_Global_Macros TimerB Global Macros
 * @{
 */

/**
 * @defgroup TIMERB_Count_Direction TimerB Count Direction
 * @{
 */
#define TIMERB_CNT_UP                           (TMRB_BCSTR_DIR)
#define TIMERB_CNT_DOWN                         ((uint16_t)0x0000U)
/**
 * @}
 */

/**
 * @defgroup TIMERB_Count_Mode TimerB Count Mode
 * @{
 */
#define TIMERB_TRIANGLE_WAVE                    (TMRB_BCSTR_MODE)
#define TIMERB_SAWTOOTH_WAVE                    ((uint16_t)0x0000U)
/**
 * @}
 */

/**
 * @defgroup TIMERB_Synchronization_Start_State TimerB Synchronization Start State
 * @{
 */
#define TIMERB_SYNC_START_ENABLE                (TMRB_BCSTR_SYNST)
#define TIMERB_SYNC_START_DISABLE               ((uint16_t)0x0000U)
/**
 * @}
 */

/**
 * @defgroup TIMERB_ClockDivision TimerB Clock Division
 * @{
 */
#define TIMERB_CLKDIV_DIV1                      ((uint16_t)0x0000U)                                             /*!< HCLK      */
#define TIMERB_CLKDIV_DIV2                      (TMRB_BCSTR_CKDIV_0)                                            /*!< HCLK/2    */
#define TIMERB_CLKDIV_DIV4                      (TMRB_BCSTR_CKDIV_1)                                            /*!< HCLK/4    */
#define TIMERB_CLKDIV_DIV8                      (TMRB_BCSTR_CKDIV_1 | TMRB_BCSTR_CKDIV_0)                       /*!< HCLK/8    */
#define TIMERB_CLKDIV_DIV16                     (TMRB_BCSTR_CKDIV_2)                                            /*!< HCLK/16   */
#define TIMERB_CLKDIV_DIV32                     (TMRB_BCSTR_CKDIV_2 | TMRB_BCSTR_CKDIV_0)                       /*!< HCLK/32   */
#define TIMERB_CLKDIV_DIV64                     (TMRB_BCSTR_CKDIV_2 | TMRB_BCSTR_CKDIV_1)                       /*!< HCLK/64   */
#define TIMERB_CLKDIV_DIV128                    (TMRB_BCSTR_CKDIV_2 | TMRB_BCSTR_CKDIV_1 | TMRB_BCSTR_CKDIV_0)  /*!< HCLK/128  */
#define TIMERB_CLKDIV_DIV256                    (TMRB_BCSTR_CKDIV_3)                                            /*!< HCLK/256  */
#define TIMERB_CLKDIV_DIV512                    (TMRB_BCSTR_CKDIV_3 | TMRB_BCSTR_CKDIV_0)                       /*!< HCLK/512  */
#define TIMERB_CLKDIV_DIV1024                   (TMRB_BCSTR_CKDIV_3 | TMRB_BCSTR_CKDIV_1)                       /*!< HCLK/1024 */
/**
 * @}
 */

/**
 * @defgroup TIMERB_Overflow_Control TimerB Overflow Control
 * @{
 */
#define TIMERB_OVERFLOW_STOP                    (TMRB_BCSTR_OVSTP)
#define TIMERB_OVERFLOW_COUNT                   ((uint16_t)0x0000U)
/**
 * @}
 */

/**
 * @defgroup TIMERB_Flag TIMERB Flag
 * @{
 */
#define TIMERB_FLAG_OVF                         (TMRB_BCSTR_OVFF)
#define TIMERB_FLAG_UDF                         (TMRB_BCSTR_UDFF)
#define TIMERB_FLAG_CMP                         (TMRB_STFLR_CMPF1)
/**
 * @}
 */

/**
 * @defgroup TIMERB_Interrupt_definition TIMERB Interrupts Definition
 * @{
 */
#define TIMERB_IT_OVF                           (TMRB_BCSTR_INENOVF)
#define TIMERB_IT_UDF                           (TMRB_BCSTR_INENUDF)
#define TIMERB_IT_CMP                           (TMRB_ICONR_ITEN1)
/**
 * @}
 */

/**
 * @defgroup TIMERB_Compare_Match_Event TimerB Compare Match Event
 * @{
 */
#define TIMERB_CMP_EVT_ENABLE                   (TMRB_ECONR_ETEN1)
#define TIMERB_CMP_EVT_DISABLE                  ((uint16_t)0x0000U)
/**
 * @}
 */

/**
 * @defgroup TIMERB_Function_Mode TimerB Function Mode
 * @{
 */
#define TIMERB_INPUT_CAPTURE                    (TMRB_CCONR_CAPMDA)     /*!< Capture input function */
#define TIMERB_OUTPUT_COMPARE                   ((uint16_t)0x0000U)     /*!< Comare output function */
/**
 * @}
 */

/**
 * @defgroup TIMERB_Input_Capture_Condition TimerB Input Capture Condition
 * @note TIMB_<t>_PWM1 _<t>_ is unit number,range 1~8
 * @{
 */
#define TIMERB_IC_RISING                        (TMRB_CCONR_HICP0)      /*!< Capture triggered by rising edge on timer input TIMB_<t>_PWM1 */
#define TIMERB_IC_FALLING                       (TMRB_CCONR_HICP1)      /*!< Capture triggered by falling edge on timer input TIMB_<t>_PWM1 */
#define TIMERB_IC_EVT                           (TMRB_CCONR_HICP2)      /*!< Capture triggered by the timer TMRB_HTSSR specified event */
#define TIMERB_IC_INVALID                       ((uint16_t)0x0000U)     /*!< Don't occur capture action */
/**
 * @}
 */

/**
 * @defgroup TIMERB_Input_Capture_Noise_Filter_Clock_Division TimerB Input Capture Noise Filter Clock Division
 * @{
 */
#define TIMERB_IC_NOFICLKDIV_NONE               ((uint16_t)0x0000U)                             /*!< Disable filter */
#define TIMERB_IC_NOFICLKDIV_DIV1               (TMRB_CCONR_NOFIENCP)                           /*!< HCLK          */
#define TIMERB_IC_NOFICLKDIV_DIV4               (TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP_0)   /*!< HCLK/4        */
#define TIMERB_IC_NOFICLKDIV_DIV16              (TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP_1)   /*!< HCLK/16       */
#define TIMERB_IC_NOFICLKDIV_DIV64              (TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP)     /*!< HCLK/64       */
/**
 * @}
 */

/**
 * @defgroup TIMERB_OC_Start_Count_Output_Polarity TimerB Output Compare Start Count Output Polarity
 * @note TIMB_<t>_PWM1 _<t>_ is unit number,range 1~8
 * @{
 */
#define TIMERB_OC_STARTCNT_OUTPUT_LOW           ((uint16_t)0x0000U) /*!< TIM_<t>_PWM1 output low level when TimerB start count */
#define TIMERB_OC_STARTCNT_OUTPUT_HIGH          (TMRB_PCONR_STAC_0) /*!< TIM_<t>_PWM1 output high level when TimerB start count */
#define TIMERB_OC_STARTCNT_OUTPUT_HOLD          (TMRB_PCONR_STAC_1) /*!< TIM_<t>_PWM1 output hold level when TimerB start count */
/**
 * @}
 */

/**
 * @defgroup TIMERB_OC_Stop_Count_Output_Polarity TimerB Output Compare Stop Count Output Polarity
 * @note TIMB_<t>_PWM1 _<t>_ is unit number,range 1~8
 * @{
 */
#define TIMERB_OC_STOPCNT_OUTPUT_LOW            ((uint16_t)0x0000U) /*!< TIM_<t>_PWM1 output low level when TimerB stop count */
#define TIMERB_OC_STOPCNT_OUTPUT_HIGH           (TMRB_PCONR_STPC_0) /*!< TIM_<t>_PWM1 output high level when TimerB stop count */
#define TIMERB_OC_STOPCNT_OUTPUT_HOLD           (TMRB_PCONR_STPC_1) /*!< TIM_<t>_PWM1 output hold level when TimerB stop count */
/**
 * @}
 */

/**
 * @defgroup TIMERB_OC_Compare_Match_Output_Polarity TimerB Output Compare Compare Match Output Polarity
 * @note TIMB_<t>_PWM1 _<t>_ is unit number,range 1~8
 * @{
 */
#define TIMERB_OC_CMPMATCH_OUTPUT_LOW           ((uint16_t)0x0000U) /*!< TIM_<t>_PWM1 output low level when TimerB comapre match */
#define TIMERB_OC_CMPMATCH_OUTPUT_HIGH          (TMRB_PCONR_CMPC_0) /*!< TIM_<t>_PWM1 output high level when TimerB comapre match */
#define TIMERB_OC_CMPMATCH_OUTPUT_HOLD          (TMRB_PCONR_CMPC_1) /*!< TIM_<t>_PWM1 output hold level when TimerB comapre match */
#define TIMERB_OC_CMPMATCH_OUTPUT_INVERTED      (TMRB_PCONR_CMPC)   /*!< TIM_<t>_PWM1 output inverted level when TimerB comapre match */
/**
 * @}
 */

/**
 * @defgroup TIMERB_OC_Period_Match_Output_Polarity TimerB Output Compare Period Match Output Polarity
 * @note TIMB_<t>_PWM1 _<t>_ is unit number,range 1~8
 * @{
 */
#define TIMERB_OC_PERIODMATCH_OUTPUT_LOW        ((uint16_t)0x0000U) /*!< TIM_<t>_PWM1 output low level when TimerB period match */
#define TIMERB_OC_PERIODMATCH_OUTPUT_HIGH       (TMRB_PCONR_PERC_0) /*!< TIM_<t>_PWM1 output high level when TimerB period match */
#define TIMERB_OC_PERIODMATCH_OUTPUT_HOLD       (TMRB_PCONR_PERC_1) /*!< TIM_<t>_PWM1 output hold level when TimerB period match */
#define TIMERB_OC_PERIODMATCH_OUTPUT_INVERTED   (TMRB_PCONR_PERC)   /*!< TIM_<t>_PWM1 output inverted level when TimerB period match */
/**
 * @}
 */

/**
 * @defgroup TIMERB_OC_Force_Output_Polarity TimerB Output Compare Force Output Polarity
 * @note TIMB_<t>_PWM1 _<t>_ is unit number,range 1~8
 * @{
 */
#define TIMERB_OC_FORCE_OUTPUT_INVALID          ((uint16_t)0x0000U) /*!< Invalid */
#define TIMERB_OC_FORCE_OUTPUT_LOW              (TMRB_PCONR_FORC_1) /*!< Force TIM_<t>_PWM1  output low level */
#define TIMERB_OC_FORCE_OUTPUT_HIGH             (TMRB_PCONR_FORC)   /*!< Force TIM_<t>_PWM1 force output high level */
/**
 * @}
 */

/**
 * @defgroup TIMERB_OC_Port_Output_State TimerB Output Compare Port Output State
 * @note TIMB_<t>_PWM1 _<t>_ is unit number,range 1~8
 * @{
 */
#define TIMERB_OC_PORT_OUTPUT_ENABLE            (TMRB_PCONR_OUTEN)  /*!< Enable Output Compare TIMB_<t>_PWM1 output function */
#define TIMERB_OC_PORT_OUTPUT_DISABLE           ((uint16_t)0x0000U) /*!< Disable Output Compare TIMB_<t>_PWM1 output function */
/**
 * @}
 */

/**
 * @defgroup TIMERB_Hardware_Start_Count_Condition TimerB Hardware Start Count Condition
 * @note TIMB_<T>_PWM1 _<T>_ is range 1~8 when sync start function is invalid
 * @note TIMB_<T>_PWM1 _<T>_ is 2,4,6, or 8 when sync start function is valid
 * @{
 */
#define TIMERB_HWSTART_INVALID                  ((uint16_t)0x0000U) /*!< Hardware start is invalid */
#define TIMERB_HWSTART_TIMB_T_PWM1_RISING       (TMRB_HCONR_HSTA0)  /*!< Hardware start by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
                                                                         hardware start by rising edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid */
#define TIMERB_HWSTART_TIMB_T_PWM1_FALLING      (TMRB_HCONR_HSTA1)  /*!< Hardware start by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
                                                                         hardware start by falling edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid */
#define TIMERB_HWSTART_TIMB_EVT                 (TMRB_HCONR_HSTA2)  /*!< Hardware start by the timer TMRB_HTSSR specified event */
/**
 * @}
 */

/**
 * @defgroup TIMERB_Hardware_Stop_Count_Condition TimerB Hardware Stop Count Condition
 * @note TIMB_<T>_PWM1 _<T>_ is range 1~8
 * @{
 */
#define TIMERB_HWSTOP_INVALID                   ((uint16_t)0x0000U) /*!< Hardware stop is invalid */
#define TIMERB_HWSTOP_TIMB_T_PWM1_RISING        (TMRB_HCONR_HSTP0)  /*!< Hardware stop by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8) */
#define TIMERB_HWSTOP_TIMB_T_PWM1_FALLING       (TMRB_HCONR_HSTP1)  /*!< Hardware stop by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8) */
#define TIMERB_HWSTOP_TIMB_EVT                  (TMRB_HCONR_HSTP2)  /*!< Hardware stop by the timer TMRB_HTSSR specified event */
/**
 * @}
 */

/**
 * @defgroup TIMERB_Hardware_Clear_Count_Condition TimerB Hardware Clear Count Condition
 * @note TIMB_<T>_PWM1 _<T>_ is range 1~8.
 * @note TIMB_<N>_PWM1 _<N>_ is 2/4/6/8 when m=1/3/5/7 OR TIMB_N_PWM1 _<N>_ is 1/3/5/7 when 2/4/6/8
 * @{
 */
#define TIMERB_HWCLEAR_INVALID                  ((uint16_t)0x0000U) /*!< Hardware clear is invalid */
#define TIMERB_HWCLEAR_TIMB_T_PWM1_RISING       (TMRB_HCONR_HCLE0)  /*!< Hardware clear count by rising edge on timer input TIMB_<t>_PWM1, t = 1~8 */
#define TIMERB_HWCLEAR_TIMB_T_PWM1_FALLING      (TMRB_HCONR_HCLE1)  /*!< Hardware clear count by falling edge on timer input TIMB_<t>_PWM1, t = 1~8 */
#define TIMERB_HWCLEAR_EVT                      (TMRB_HCONR_HCLE2)  /*!< Hardware clear count by the timer TMRB_HTSSR specified event */
#define TIMERB_HWCLEAR_TIMB_N_PWM1_RISING       (TMRB_HCONR_HCLE3)  /*!< Hardware clear count by rising edge on timer input TIMB_<n>_PWM1, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8 */
#define TIMERB_HWCLEAR_TIMB_N_PWM1_FALLING      (TMRB_HCONR_HCLE4)  /*!< Hardware clear count by falling edge on timer input TIMB_<n>_PWM1, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8 */
/**
 * @}
 */

/**
 * @defgroup TIMERB_Hardware_Count_Up_Condition TimerB Hardware Count Up Condition
 * @note TIMB_<T>_PWM1 _<T>_ is range 1~8.
 * @note TIMB_<N>_PWM1 _<N>_ is 2/4/6/8 when m=1/3/5/7 OR TIMB_N_PWM1 _<N>_ is 1/3/5/7 when 2/4/6/8
 * @{
 */
#define TIMERB_HWUP_INVALID                     ((uint16_t)0x0000U) /*!< Hardware count up is invalid */
#define TIMERB_HWUP_TIMB_T_PWM1_RISING          (TMRB_HCUPR_HCUP8)  /*!< Hardware count up by rising edge on timer input TIMB_<t>_PWM1, t = 1~8 */
#define TIMERB_HWUP_TIMB_T_PWM1_FALLING         (TMRB_HCUPR_HCUP9)  /*!< Hardware count up by falling edge on timer input TIMB_<t>_PWM1, t = 1~8 */
#define TIMERB_HWUP_EVT                         (TMRB_HCUPR_HCUP10) /*!< Hardware count up by the timer TMRB_HTSSR specified event */
#define TIMERB_HWUP_OVERFLOW                    (TMRB_HCUPR_HCUP11) /*!< Hardware count up by overflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8 */
#define TIMERB_HWUP_UNDERFLOW                   (TMRB_HCUPR_HCUP12) /*!< Hardware count up by underflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8 */
/**
 * @}
 */

/**
 * @defgroup TIMERB_Hardware_Count_Down_Condition TimerB Hardware Count Down Condition
 * @note TIMB_<T>_PWM1 _<T>_ is range 1~8.
 * @note TIMB_<N>_PWM1 _<N>_ is 2/4/6/8 when m=1/3/5/7 OR TIMB_N_PWM1 _<N>_ is 1/3/5/7 when 2/4/6/8
 * @{
 */
#define TIMERB_HWDOWN_INVALID                   ((uint16_t)0x0000U) /*!< Hardware count down is invalid */
#define TIMERB_HWDOWN_TIMB_T_PWM1_RISING        (TMRB_HCDOR_HCDO8)  /*!< Hardware count down by rising edge on timer input TIMB_<t>_PWM1, t = 1~8 */
#define TIMERB_HWDOWN_TIMB_T_PWM1_FALLING       (TMRB_HCDOR_HCDO9)  /*!< Hardware count down by falling edge on timer input TIMB_<t>_PWM1, t = 1~8 */
#define TIMERB_HWDOWN_EVT                       (TMRB_HCDOR_HCDO10) /*!< Hardware count down by the timer TMRB_HTSSR specified event */
#define TIMERB_HWDOWN_OVERFLOW                  (TMRB_HCDOR_HCDO11) /*!< Hardware count down by overflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8 */
#define TIMERB_HWDOWN_UNDERFLOW                 (TMRB_HCDOR_HCDO12) /*!< Hardware count down by underflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8 */
/**
 * @}
 */

/**
 * @}
 */

