levizh/hc32m423/ddl/hc32m423_ddl/driver/inc/hc32m423_timerb.h
/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/
/**
 * @addtogroup TIMERB_Global_Functions
 * @{
 */

/**
 * @brief  Set the TimerB counter value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Value Counter value (between Min_Data=0 and Max_Data=0xFFFF)
 * @retval None
 */
__STATIC_INLINE void TIMERB_SetCounter(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Value)
{
    WRITE_REG16(TMRBx->CNTER, u16Value);
}

/**
 * @brief  Get the TimerB counter value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Counter value (between Min_Data=0 and Max_Data=0xFFFF)
 */
__STATIC_INLINE uint16_t TIMERB_GetCounter(M0P_TMRB_TypeDef *TMRBx)
{
    return READ_REG16(TMRBx->CNTER);
}

/**
 * @brief  Set TimerB period register value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Value Period value (between Min_Data=0 and Max_Data=0xFFFF)
 * @retval None
 */
__STATIC_INLINE void TIMERB_SetPeriod(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Value)
{
    WRITE_REG16(TMRBx->PERAR, u16Value);
}

/**
 * @brief  Get TimerB period register value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Period value (between Min_Data=0 and Max_Data=0xFFFF)
 */
__STATIC_INLINE uint16_t TIMERB_GetPeriod(M0P_TMRB_TypeDef *TMRBx)
{
    return READ_REG16(TMRBx->PERAR);
}

/**
 * @brief  Set TimerB compare register value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @param  [in] u16Value Compare value (between Min_Data=0 and Max_Data=0xFFFF)
 * @retval None
 */
__STATIC_INLINE void TIMERB_SetCompare(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Value)
{
    WRITE_REG16(TMRBx->CMPAR, u16Value);
}

/**
 * @brief  Get TimerB compare register value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval Compare value (between Min_Data=0 and Max_Data=0xFFFF)
 */
__STATIC_INLINE uint16_t TIMERB_GetCompare(M0P_TMRB_TypeDef *TMRBx)
{
    return READ_REG16(TMRBx->CMPAR);
}

/**
 * @brief  Start TimerB.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void TIMERB_Start(M0P_TMRB_TypeDef *TMRBx)
{
    SET_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_START);
}

/**
 * @brief  Stop TimerB.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void TIMERB_Stop(M0P_TMRB_TypeDef *TMRBx)
{
    CLEAR_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_START);
}

/**
 * @brief  Enable TimerB synchronization start function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void TIMERB_EnableSyncStart(M0P_TMRB_TypeDef *TMRBx)
{
    SET_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_SYNST);
}

/**
 * @brief  Disable TimerB synchronization start function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void TIMERB_DisableSyncStart(M0P_TMRB_TypeDef *TMRBx)
{
    CLEAR_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_SYNST);
}

/**
 * @brief  Enable TimerB compare match event.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void TIMERB_EnableCmpMatchEvt(M0P_TMRB_TypeDef *TMRBx)
{
    SET_REG16_BIT(TMRBx->ECONR, TMRB_ECONR_ETEN1);
}

/**
 * @brief  Disable TimerB compare match event.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void TIMERB_DisableCmpMatchEvt(M0P_TMRB_TypeDef *TMRBx)
{
    CLEAR_REG16_BIT(TMRBx->ECONR, TMRB_ECONR_ETEN1);
}

/**
 * @brief  Enable TimerB input capture noise filter function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void TIMERB_IC_EnableNoiseFilter(M0P_TMRB_TypeDef *TMRBx)
{
    SET_REG16_BIT(TMRBx->CCONR, TMRB_CCONR_NOFIENCP);
}

/**
 * @brief  Disable TimerB input capture noise filter function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void TIMERB_IC_DisableNoiseFilter(M0P_TMRB_TypeDef *TMRBx)
{
    CLEAR_REG16_BIT(TMRBx->CCONR, TMRB_CCONR_NOFIENCP);
}

/**
 * @brief  Enable TimerB output compare port output function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void TIMERB_OC_EnablePortOutput(M0P_TMRB_TypeDef *TMRBx)
{
    SET_REG16_BIT(TMRBx->PCONR, TMRB_PCONR_OUTEN);
}

/**
 * @brief  Disable TimerB output compare port output function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M0P_TMRB1:            TimerB unit 1 instance register base
 *           @arg M0P_TMRB2:            TimerB unit 2 instance register base
 *           @arg M0P_TMRB3:            TimerB unit 3 instance register base
 *           @arg M0P_TMRB4:            TimerB unit 4 instance register base
 * @retval None
 */
__STATIC_INLINE void TIMERB_OC_DisablePortOutput(M0P_TMRB_TypeDef *TMRBx)
{
    CLEAR_REG16_BIT(TMRBx->PCONR, TMRB_PCONR_OUTEN);
}

/**
 * @brief  Set TimerB trigger event source.
 * @param  [in] enEvtSrc                Trigger event source @ref en_event_src_t
 * @retval None
 */
__STATIC_INLINE void TIMERB_SetTriggerSrc(en_event_src_t enEvtSrc)
{
    WRITE_REG32(M0P_AOS->TMRB_HTSSR, enEvtSrc);
}

/**
 * @brief  Get TimerB trigger event source.
 * @param  None
 * @retval An en_event_src_t enumeration value
 */
__STATIC_INLINE en_event_src_t TIMERB_GetTriggerSrc(void)
{
    return (en_event_src_t)READ_REG32(M0P_AOS->TMRB_HTSSR);
}

/* Initialization and configuration TimerB base functions */
en_result_t TIMERB_Init(M0P_TMRB_TypeDef *TMRBx,
                            const stc_timerb_init_t *pstcInit);
en_result_t TIMERB_StructInit(stc_timerb_init_t *pstcInit);
en_result_t TIMERB_DeInit(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_SetCntDirection(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Direction);
uint16_t TIMERB_GetCntDirection(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_SetCntMode(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Mode);
uint16_t TIMERB_GetCntMode(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_SetClkDiv(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Div);
uint16_t TIMERB_GetClkDiv(M0P_TMRB_TypeDef *TMRBx);
en_flag_status_t TIMERB_GetFlag(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Flag);
void TIMERB_ClearFlag(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Flag);
void TIMERB_IntCmd(M0P_TMRB_TypeDef *TMRBx,
                        uint16_t u16IntSource,
                        en_functional_state_t enNewSta);
void TIMERB_SetMode(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Mode);
uint16_t TIMERB_GetMode(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_SetHwTriggerCondition(M0P_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition);
void TIMERB_SetHwStartCondition(M0P_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition);
uint16_t TIMERB_GetHwStartCondition(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_SetHwStopCondition(M0P_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition);
uint16_t TIMERB_GetHwStopCondition(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_SetHwClearCondition(M0P_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition);
uint16_t TIMERB_GetHwClearCondition(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_SetHwUpCondition(M0P_TMRB_TypeDef *TMRBx,
                                    uint16_t u16Condition);
uint16_t TIMERB_GetHwUpCondition(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_SetHwDownCondition(M0P_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition);
uint16_t TIMERB_GetHwDownCondition(M0P_TMRB_TypeDef *TMRBx);

/* Initialization and configuration TimerB input capture functions */
en_result_t TIMERB_IC_Init(M0P_TMRB_TypeDef *TMRBx, 
                                const stc_timerb_ic_init_t *pstcIcInit);
en_result_t TIMERB_IC_StructInit(stc_timerb_ic_init_t *pstcIcInit);
en_result_t TIMERB_IC_DeInit(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_IC_SetCaptureCondition(M0P_TMRB_TypeDef *TMRBx,
                                            uint16_t u16Condition);
uint16_t TIMERB_IC_GetCaptureCondition(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_IC_SetFilterClkDiv(M0P_TMRB_TypeDef *TMRBx, uint16_t u16Div);
uint16_t TIMERB_IC_GetFilterClkDiv(M0P_TMRB_TypeDef *TMRBx);

