levizh/hc32m423/ddl/hc32m423_ddl/driver/inc/hc32m423_timerb.h
/* Initialization and configuration TimerB output compare functions */
en_result_t TIMERB_OC_Init(M0P_TMRB_TypeDef *TMRBx,
                                const stc_timerb_oc_init_t *pstcOcInit);
en_result_t TIMERB_OC_StructInit(stc_timerb_oc_init_t *pstcOcInit);
en_result_t TIMERB_OC_DeInit(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_OC_SetStartCntOutputPolarity(M0P_TMRB_TypeDef *TMRBx,
                                                    uint16_t u16Polarity);
uint16_t TIMERB_OC_GetStartCntOutputPolarity(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_OC_SetStopCntOutputPolarity(M0P_TMRB_TypeDef *TMRBx,
                                                    uint16_t u16Polarity);
uint16_t TIMERB_OC_GetStopCntOutputPolarity(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_OC_SetCmpMatchOutputPolarity(M0P_TMRB_TypeDef *TMRBx,
                                                    uint16_t u16Polarity);
uint16_t TIMERB_OC_GetCmpMatchOutputPolarity(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_OC_SetPeriodMatchOutputPolarity(M0P_TMRB_TypeDef *TMRBx,
                                                        uint16_t u16Polarity);
uint16_t TIMERB_OC_GetPeriodMatchOutputPolarity(M0P_TMRB_TypeDef *TMRBx);
void TIMERB_OC_SetForceOutputPolarity(M0P_TMRB_TypeDef *TMRBx,
                                                uint16_t u16Polarity);
uint16_t TIMERB_OC_GetForceOutputPolarity(M0P_TMRB_TypeDef *TMRBx);

/**
 * @}
 */

#endif /* DDL_TIMERB_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __HC32M423_TIMERB_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
